Tekla Open API Reference for Tekla Structures 2025
AnalysisPartBarAttributes.SplitDistances Property
 The split distances.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> SplitDistances { get; set; }
Public Property SplitDistances As List(Of Double)
	Get
	Set
Property Value
Type: List<Double>
See Also
Reference
AnalysisPartBarAttributes Class
Tekla.Structures.Analysis Namespace